#include <stdio.h>
int main () {
    unsigned int n;
    float a;
    printf("Type a positive number.\n ");
    scanf("%u", &n);                         //Εισαγωγή θετικού ακεραίου//
    printf("%u \n", n);
    if (n==1) {                              //Αν είναι 1 δεν έχει νόημα η εικασία και την τυπώνω από κάτω//
    }else {
        do{
            a=n%2;                           //Βρίσκω το υπόλοιπο με το δύο για να δω αν είανι άρτιος ή περιττός//
            if(a==0) {                       //Αν άρτιος έχει υπόλοιπο 0 και ανατρέχω στο τύπο//
                n = n / 2;
                printf ("%u \n", n);
            }else {                            //Αλλιώς είναι περιττός και αντρέχω στον άλλο τύπο//
                n = 3 * n + 1;
                printf ("%u \n", n);}
        }while(n!=1);
    }





}
